secure boot: formatting and plantuml diagrams
