--- a/security/secure_boot.md
+++ b/security/secure_boot.md
@@ -52,106 +52,116 @@ However, other hardware/software engineers may benefit from reading this documen
+-> "Second Stage\nBootloader"
+-> "Operating \nSystem"
 
-```mermaid
-flowchart LR
-    A(bootROM) --> B(First Stage Bootloader)
-    B --> C(Second Stage Bootloader)
-    C --> D(Operating System)
-    E(Adversary) -->|Attack| A
-    E -->|Attack| B
-    E -->|Attack| C
-    E -->|Attack| D
+@enduml
 ```
 
-Low-level malware may allow adversaries to steal intellectual property, credentials and other
-sensitive data. It also has the potential to render the system unusable or permanently damaged, or
@@
+to ensure the next image is whole before it is allowed to execute. From a security perspective, this
+is quite dangerous as it allows the presence of low-level persistent malware.
+
+```plantuml
+@startuml
+
+!theme spacelab
+skinparam nodesep 50
+skinparam linetype ortho
+
+(*) -right-> "bootROM"
+-> "First Stage\nBootloader"
+-> "Second Stage\nBootloader"
+-> "Operating\nSystem"
+"Adversary" -up->[Attack] "bootROM"
+"Adversary" -up->[Attack] "First Stage\nBootloader"
+"Adversary" -up->[Attack] "Second Stage\nBootloader"
+
+@enduml
+```
+
+Low-level malware may allow adversaries to compromise or steal intellectual property, credentials
+and other sensitive or critical data. It also has the potential to render the system unusable or
